edwinm/esp32-terminal/sdkconfig.defaults
# Makerfabs ESP32-S3 Parallel TFT 3.5" (N16R2) — ESP-IDF 5.5.x defaults
CONFIG_IDF_TARGET="esp32s3"

# --- Flash: 16 MB, quad (QIO), 80 MHz ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM: 2 MB embedded QUAD (WROOM-1-N16R2) — NOT octal ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# --- CPU / performance ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000

# --- Console stays on UART0 (CP2104). Native USB is reserved for TinyUSB HID. ---
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# --- TinyUSB: enable one HID interface on the native USB-OTG port ---
CONFIG_TINYUSB_HID_COUNT=1

# --- FATFS (SD card, long filenames) ---
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# --- Main task stack (UI bring-up happens here) ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- LVGL (managed component Kconfig) ---
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_DEF_REFR_PERIOD=16
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
